// ====================================================================================================================== //

// Задача 1. 
// Створити клас TDate для роботи із датами у форматі “день.місяць.рік”. 
// Дата представляється структурою із трьома полями.
// Реалізувати методи збільшення / зменшення дати на певну кількість днів, місяців чи років.
// Введення та виведення дати реалізувати за допомогою методу  toString.

// ====================================================================================================================== //



// ====================================================================================================================== //


// ====================================================================================================================== //
