// =========================================================== //
// Задача 3.  З використанням замикань розробити ітератор, 
// тобто функцію, що буде поступово за окремими викликами видавати по одне значення від заданого мінімального до заданого максимального.
// Якщо значення досягне максимального, то наступним буде мінімальне значення.
// З використанням цієї функції реалізувати перебір номерів місяців.
// =========================================================== //

let minMonth = 1
let maxMonth = 12

function iteratorOfMonth(minM, maxM) {
    let min = minM - 1
    function increment() {
        if (min === maxM) {
            min = minM
            return min
        }
        else return ++min

    }

    return increment

}

let cntrOfMonth = iteratorOfMonth(minMonth, maxMonth)

for (let i = 0; i < 26; i++) {
    document.write(`<div class= "js-output" > ${cntrOfMonth()} <br></ div> `)

}

// =========================================================== //

