// ====================================================================================================================== //
// Задача 7. 
// Подорож складається з 3 етапів. 
// На кожному етапі користувач може вибрати один з видів:
// транспорту(авто, автобус, літак - випадаючий список)
// харчування(сніданок, обід, вечеря – checkbоx)
// одного з 3 - х гідів(використати - radio buttons). 

// Ціни визначте самі.
// Підрахувати загальну вартість.
// ====================================================================================================================== //
function calculate() {
    let transport = parseInt(document.getElementById("transport").value)

    let allValues = document.getElementsByTagName("input");
    let sum = transport;
    for (const inp of allValues) {
        if (inp.checked) sum += parseFloat(inp.value)
    }

    document.querySelector(`.innerTable`).innerHTML = `Total cost: ${sum}`
}

// ====================================================================================================================== //

// ====================================================================================================================== //

