// ====================================================================================================================== //
// Розробити Клас DOG

// --- властивості ---
// Координата Х
// Координата У
// шлях до зображення
// інтервал оновлення

// --- методи ---
// генерування елемента розмітки
// оновлення через вказаний інтервал (випадкове зміщення по горизонталі (зміна координати Х))

// ====================================================================================================================== //



// ====================================================================================================================== //


