// ====================================================================================================================== //
// Розробити Клас House

// --- властивості-- -
//     Координата Х
// Координата У
// шлях до зображення
// інтервал оновлення

// --- методи-- -
//     генерування елемента розмітки
// оновлення через вказаний інтервал(збільшення або зменшення масштабу(об’єкт не рухається)

// ====================================================================================================================== //



// ====================================================================================================================== //


