// ====================================================================================================================== //
// Створити клас Client
//       Властивості
//             ID
//             ПІБ
//             Кількість грошей на рахунку
//       Методи
//             Додавання грошей
//             Зняття грошей
//             ToString
//
// На основі цього класу створити клас GoldenClient
//         Властивості
//                 ID
//                 ПІБ
//                 Кількість грошей на рахунку
//                 Ліміт кредитних коштів
//                 Відсоток за використання кредитних коштів
//         Методи
//                 Додавання грошей
//                 Зняття грошей
//                 Визначення пені за використання кредитних коштів
//                 ToString
// ====================================================================================================================== //

// Створити клас Bank, у якому зберігається масив клієнтів.
// Виконати такі операці:
//                         Вивести усіх простих клієнтів;
//                         Вивести усіх клієнтів GoldenClient;
//                         Знати сумарну кількість грошей на рахунку;

// ====================================================================================================================== //


