// ====================================================================================================================== //
// Розробити Клас Bird

// --- властивості ---
// Координата Х
// Координата У
// шлях до зображення
// інтервал оновлення

// --- методи ---
// генерування елемента розмітки
// оновлення через вказаний інтервал (випадкове переміщення у довільному напрямку)

// ====================================================================================================================== //



// ====================================================================================================================== //


