// ====================================================================================================================== //
// Задача 5. Розробити клас «Керівник танців»

// Поля	    Масив імен хлопців
//          Масив імен дівчат

// Методи	Метод випадкового вибору імені хлопця
//          Метод випадкового вибору імені дівчини
//          Метод виведення пари для танців
//          Метод run , який ініціює через кожні 5 секунд виведення нової пари для танців

// ====================================================================================================================== //


// ====================================================================================================================== //


// ====================================================================================================================== //
