// ====================================================================================================================== //
// Задача 3. Розробити клас MultChecker для перевірки таблиці множення

// Поля	    Число, яке перевіряємо (наприклад, перевірка частини таблиці множення на 7)
//          Кількість правильних відповідей
//          Кількість неправильних відповідей

// Методи	Генерування прикладу (метод випадковим чином визначає друге число, перше число фіксоване)
//          Перевірка правильності вказаної відповіді
//          render - виведення інформації про тестування на екран


// ====================================================================================================================== //


// ====================================================================================================================== //


// ====================================================================================================================== //
